app/controllers/clients_controller.rb

  def index

    @user = User.find(session[:user_id])
    @clients = @user.clients.all(:order => :rate)
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)
SELECT * FROM `clients` WHERE (`clients`.user_id = 1) ORDER BY rate DESC

  def show
    @user = User.find(session[:user_id])

    @client = @user.clients.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)
SELECT * FROM `clients` WHERE (`clients`.`id` = 2 AND (`clients`.user_id = 1))

  def edit
    @user = User.find(session[:user_id])

    @client = @user.clients.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)
SELECT * FROM `clients` WHERE (`clients`.`id` = 2 AND (`clients`.user_id = 1))

  def create

    @user = User.find(session[:user_id])

    @client = @user.clients.new(params[:client])

    respond_to do |format|
      if @client.save
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)
INSERT INTO `clients` (`name`, `created_at`, `comments`, `updated_at`, `rate`) VALUES('Jason Parkin', '2010-05-03 16:14:00', 'Rate going up to 50 after H&M', '2010-05-03 16:14:00', 40)

  def update
    @user = User.find(session[:user_id])

    @client = @user.clients.find(params[:id])

    respond_to do |format|
      if @client.update_attributes(params[:client])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)
SELECT * FROM `clients` WHERE (`clients`.`id` = 2 AND (`clients`.user_id = 1))
UPDATE `clients` SET `updated_at` = '2010-05-03 19:32:41', `comments` = 'Going up to 50 after H&M' WHERE `id` = 2