app/controllers/notes_controller.rb

SELECT * FROM `panels` WHERE (`panels`.`css_name` = 'comments') AND (`panels`.project_id = 39) LIMIT 1
---
  def new
    @user = User.find(session[:user_id])
    @project = @user.projects.find(params[:project_id])
    @panel = @project.panels.find_by_css_name(params[:panel])