app/controllers/notes_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 1)
SELECT * FROM `projects` WHERE (`projects`.`id` = 12 AND (`projects`.user_id = 1))
SELECT * FROM `notes` WHERE (`notes`.project_id = 12) ORDER BY notes.id DESC LIMIT 1
SELECT * FROM `projects` ORDER BY projects.id DESC LIMIT 1
INSERT INTO `notes` (`created_at`, `project_id`, `rev`, `updated_at`, `client_id`, `user_id`, `content`) VALUES('2010-05-03 19:20:45', 12, NULL, '2010-05-03 19:20:45', NULL, NULL, 'Rocking this house\n\n\n\nYo\n\nWhat\'s up?\n\nOkay then, hankie\n\ntonk')
---
  def new
    @user = User.find(session[:user_id])
    @project = @user.projects.find(params[:project_id])
    if ! @project.nil?
      @rev = @project.notes.last.rev + 1
      @note = @project.notes.new({ :content => params[:content], :rev => @rev })
      @note.save