app/controllers/projects_controller.rb

  def archive

    @user = User.find(session[:user_id])

    @project = @user.projects.find(params[:id])
---
SELECT * FROM `projects` WHERE (`projects`.`id` = 3 AND (`projects`.user_id = 1))

  def create
    @user = User.find(session[:user_id])

    @client = @user.clients.find(params[:project][:client_id])

    @project = @client.projects.new(params[:project])
    @project.user_id = User.find(session[:user_id]).id

    respond_to do |format|
      if @project.save

        @project.notes.new({:client_id => @client.id, :user_id => @user.id, :rev => 1 }).save
---
INSERT INTO `notes` (`created_at`, `panel_id`, `project_id`, `rev`, `updated_at`, `client_id`, `user_id`, `content`) VALUES('2010-05-20 05:32:03', NULL, 37, 1, '2010-05-20 05:32:03', 2, 1, NULL)