app/controllers/projects_controller.rb

  def archive

    @user = User.find(session[:user_id])

    @project = @user.projects.find_by_url(params[:id])
    @project.archive = true

    if @project.save
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)
SELECT * FROM `projects` WHERE (`projects`.`url` = 'rock-it-3') AND (`projects`.user_id = 1) LIMIT 1
UPDATE `projects` SET `updated_at` = '2010-05-03 20:04:13', `archive` = 1 WHERE `id` = 3

  def archived
    @user = User.find(session[:user_id])
    @projects = @user.projects.all(:conditions => [" archive IS TRUE "])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)
SELECT * FROM `projects` WHERE ( archive IS TRUE ) AND (`projects`.user_id = 1)

  def index
    @user = User.find(session[:user_id])
    @projects = @user.projects.all(:conditions => [" /*archive IS FALSE ||*/ archive IS NULL "])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)
SELECT * FROM `projects` WHERE ( archive != 1 || archive IS NULL ) AND (`projects`.user_id = 1)

  def addPanel
    @user = User.find(session[:user_id])
    @project = @user.projects.find_by_url(params[:id])
    panel = @project.panels.new({:title => params[:panel]})
    panel.save
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)
SELECT * FROM `projects` WHERE (`projects`.`url` = 'poo') AND (`projects`.user_id = 1) LIMIT 1
INSERT INTO `panels` (`created_at`, `title`, `project_id`, `updated_at`, `css_name`) VALUES('2010-05-20 15:31:32', 'fuck\'s at the you\"s', 39, '2010-05-20 15:31:32', NULL)

  def show
    @user = User.find(session[:user_id])

    @project = @user.projects.find_by_url(params[:id])
    if @project.nil?
      @project = @user.projects.find(params[:id])
    end

    if @project.panels.empty?
      panel = @project.panels.new({:title => 'comments'})
      panel.save
      note = @project.notes.last

      new_note = panel.notes.new({:content => note.content, :rev => note.rev})
      new_note.save
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)
SELECT * FROM `projects` WHERE (`projects`.`url` = '15') AND (`projects`.user_id = 1) LIMIT 1
SELECT * FROM `projects` WHERE (`projects`.`id` = 3 AND (`projects`.user_id = 1))
SELECT * FROM `panels` WHERE (`panels`.project_id = 35) LIMIT 1
SELECT * FROM `projects` ORDER BY projects.id DESC LIMIT 1
SELECT count(*) AS count_all FROM `panels` WHERE (`panels`.project_id = 31)
INSERT INTO `panels` (`created_at`, `title`, `project_id`, `updated_at`, `css_name`) VALUES('2010-05-20 15:32:06', 'Fucks\'s at the you\"s', NULL, '2010-05-20 15:32:06', NULL)
SELECT * FROM `notes` WHERE (`notes`.project_id = 12) ORDER BY notes.id DESC LIMIT 1
INSERT INTO `notes` (`created_at`, `panel_id`, `project_id`, `rev`, `updated_at`, `client_id`, `user_id`, `content`) VALUES('2010-05-20 15:15:42', 19, NULL, 1, '2010-05-20 15:15:42', NULL, NULL, NULL)

  def edit

    @user = User.find(session[:user_id])

    @project = @user.projects.find_by_url(params[:id])
    if @project.nil?
      @project = @user.projects.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)
SELECT * FROM `projects` WHERE (`projects`.`url` = 'rock-it') AND (`projects`.user_id = 1) LIMIT 1
SELECT * FROM `projects` WHERE (`projects`.`id` = 3 AND (`projects`.user_id = 1))

  def create
    @user = User.find(session[:user_id])

    @client = @user.clients.find(params[:project][:client_id])

    @project = @client.projects.new(params[:project])
    @project.user_id = User.find(session[:user_id]).id

    respond_to do |format|
      if @project.save


        @project.panels.new({:title => 'comments', :project_id => self.id}).save
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)
SELECT * FROM `clients` WHERE (`clients`.`id` = 2 AND (`clients`.user_id = 1))
SELECT * FROM `projects` WHERE (url LIKE 'rock-it%' )
INSERT INTO `projects` (`created_at`, `title`, `updated_at`, `archive`, `url`, `duedate`, `client_id`, `user_id`, `startdate`) VALUES('2010-05-04 19:59:58', 'rock it out \"BITHCES\" what\'s up', '2010-05-04 19:59:58', NULL, 'rock-it-out-bithces-whats-up', '2010-05-04', 2, 1, '2010-05-04')
INSERT INTO `panels` (`created_at`, `title`, `project_id`, `updated_at`, `css_name`) VALUES('2010-05-20 15:31:19', 'comments', 39, '2010-05-20 15:31:19', NULL)

  def update

    @user = User.find(session[:user_id])

    @project = @user.projects.find(params[:id])

    respond_to do |format|
      if @project.update_attributes(params[:project])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)
SELECT * FROM `projects` WHERE (`projects`.`id` = 19 AND (`projects`.user_id = 1))
UPDATE `projects` SET `updated_at` = '2010-05-04 20:04:03', `url` = 'rock-it-out-bithces-whats-up_sucka' WHERE `id` = 19

  def destroy

    @user = User.find(session[:user_id])

    @project = @user.projects.find(params[:id])
    @project.destroy
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)
SELECT * FROM `projects` WHERE (`projects`.`id` = 15 AND (`projects`.user_id = 1))
DELETE FROM `projects` WHERE `id` = 15